{"name": "The Carlisle Desk", "price": "None", "currency": "None", "width": "160", "height": "75", "depth": "85", "dimension_unit": "cm", "description": "A beautiful desk of classic inspiration, it is hard to imagine a more elegant place to work than at the Carlisle. The epitome of understated chic, this writing table exemplifies DAVIDSON's ability to take a traditional design and elevate it to something timeless. Created by master craftsmen in the UK, the Carlisle represents the very best of luxury furniture. With its leather writing surface, convenient cable management system, and thoughtfully-crafted drawers, it not only fulfils but exceeds the requirements of form, function and technical finesse. With an impressively-sleek body, the Carlisle is a versatile piece that would flatter a variety of room schemes. Special lacquering techniques have been used to achieve a brilliant, high-gloss or satin finish, whose gleam is echoed by the luxe nickel or brass detailing of the trim and handles. The silhouette of the Carlisle conveys something quintessentially British. Compared to the others in the collection, the desk is more traditional in mood. Its ogee moulding to the underside of the tabletop and cavetto moulding to the plinth are both hallmarks of classic luxury furniture.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2022/05/Carlisle_Desk_SycamoreBlack_PolishedNickel_DAVIDSONLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 13}, {"style_name": ".MINIMALISM", "weight": 4}, {"style_name": ".MID_CENTURY_MODERN", "weight": 22}, {"style_name": ".COUNTRY", "weight": 2}, {"style_name": ".COSTAL", "weight": 4}, {"style_name": ".RUSTIC", "weight": 4}, {"style_name": ".ART_DECO", "weight": 3}, {"style_name": ".INDUSTRIAL", "weight": 2}, {"style_name": ".SHABBY_CHIC", "weight": 5}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 5}, {"style_name": ".BOHEMIAN", "weight": 1}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 0}, {"style_name": ".TRANSITIONAL", "weight": 8}, {"style_name": ".CHALET", "weight": 2}, {"style_name": ".FRENCH_CLASSICAL", "weight": 10}, {"style_name": ".SCANDINAVIAN", "weight": 7}]}