{"name": "The Beam Console Table by Kelly Hoppen", "price": "None", "currency": "None", "width": "120", "height": "80", "depth": "40", "dimension_unit": "cm", "description": "Discover the Beam Console Table, a testament to the creative fusion between renowned designer Kelly Hoppen and DAVIDSON. This luxury console table is a timeless piece that brings a sense of balance and sophistication to any room with its clean lines and soft curves. Crafted with taupe ash legs, inspired by Kelly Hoppen's signature taupe, the Beam Console Table exudes warmth and elegance. The black lacquered top adds a sleek and polished touch, making it a versatile piece that complements a variety of interior styles. This console table stands as a sleek and timeless addition to your space, designed to be both pleasing to the eye and highly functional. The contrast between the black lacquered top and the veneer legs creates a visual focal point, adding depth and refinement to the design. Supported by three tapered legs, the Beam Console Table is a testament to meticulous craftsmanship and thoughtful design. Elevate your interior with this exceptional piece, a result of the collaboration between Kelly Hoppen and DAVIDSON. This console table transcends the ordinary, becoming a statement of style, sophistication, and luxury. It not only reflects Kelly Hoppen's renowned design sensibilities but also showcases DAVIDSON's commitment to crafting exquisite pieces that stand the test of time.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2023/10/Beam_Console_KellyHoppenxDavidsonLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 7}, {"style_name": ".MINIMALISM", "weight": 11}, {"style_name": ".MID_CENTURY_MODERN", "weight": 12}, {"style_name": ".COUNTRY", "weight": 1}, {"style_name": ".COSTAL", "weight": 5}, {"style_name": ".RUSTIC", "weight": 5}, {"style_name": ".ART_DECO", "weight": 2}, {"style_name": ".INDUSTRIAL", "weight": 2}, {"style_name": ".SHABBY_CHIC", "weight": 2}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 7}, {"style_name": ".BOHEMIAN", "weight": 1}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 0}, {"style_name": ".TRANSITIONAL", "weight": 5}, {"style_name": ".CHALET", "weight": 8}, {"style_name": ".FRENCH_CLASSICAL", "weight": 6}, {"style_name": ".SCANDINAVIAN", "weight": 19}]}