{"name": "The Chrysler Dressing Table", "price": "None", "currency": "None", "width": "180", "height": "85", "depth": "75", "dimension_unit": "cm", "description": "The ultimate in deluxe bedroom furniture, the Chrysler dressing table with optional mirror allows every woman to prepare for the day ahead in style. With its gorgeous curves, it is undeniably feminine standing out from the crowd. Add a stunning focal point to your bedroom with a dressing table that exudes charm and grace. The stately size of the Chrysler vanity allows it to carry off many different accents without appearing swamped. It is also available in an array of well-proportioned sizes and beautiful finish options. Defined by curves and circular forms, the Chrysler conveys a mood of softness and gentle sophistication. Despite its chunkier top and pedestals, it does not feel remotely heavy, a result of its light-coloured finish and sweeping lines that draw the eye rather than block out space. Fulfilling practical as well as aesthetic requirements, the Chrysler's ample storage consists of a central compartmentalised drawer for storing jewellery or other boudoir essentials. Then, on each side, are four drawers on soft-close runners for impeccable functionality. The interior of the drawers are lined in satin wood to match the exterior finish.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2022/05/Chrysler_DressingTable_Walnut_WhiteGoldLeaf_DAVIDSONLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 9}, {"style_name": ".MINIMALISM", "weight": 0}, {"style_name": ".MID_CENTURY_MODERN", "weight": 28}, {"style_name": ".COUNTRY", "weight": 3}, {"style_name": ".COSTAL", "weight": 5}, {"style_name": ".RUSTIC", "weight": 5}, {"style_name": ".ART_DECO", "weight": 11}, {"style_name": ".INDUSTRIAL", "weight": 1}, {"style_name": ".SHABBY_CHIC", "weight": 0}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 8}, {"style_name": ".BOHEMIAN", "weight": 4}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 0}, {"style_name": ".TRANSITIONAL", "weight": 4}, {"style_name": ".CHALET", "weight": 6}, {"style_name": ".FRENCH_CLASSICAL", "weight": 3}, {"style_name": ".SCANDINAVIAN", "weight": 5}]}