{"name": "The Drift Console Table by Kelly Hoppen", "price": "None", "currency": "£", "width": "130", "height": "80", "depth": "35", "dimension_unit": "cm", "description": "Discover the Drift Console Table, a testament to the collaborative brilliance of Kelly Hoppen for DAVIDSON. This luxury side table effortlessly combines form and function, adding a touch of refined sophistication to your space. The console's grey ash legs provide a solid, grounding base, complemented by the pristine white lacquered top that exudes a sense of modern elegance. The Drift Console Table boasts a bold and distinctive shape, making it a statement piece that draws attention in any setting. The chunky, deep top finished in a bright white lacquer not only catches the eye but also offers a functional surface for your cherished items. Crafted with precision, the three legs present a modern aesthetic that complements the clean lines of the top. The juxtaposition of organic waves in the ash veneer against the geometric legs adds an intriguing visual contrast, elevating the table's design. The high gloss lacquer top harmoniously contrasts with the matte finish of the ash veneer legs, creating a visually captivating piece. Place the console in a hallway, and style it with an arrangement of art, or use it as a stylish room divider behind a sofa, showcasing a curated selection of high-end decorative objects. Its clean lines and distinctive shape make it perfectly suited for contemporary spaces that appreciate standout design elements. The round top gracefully sits upon three shaped legs, creating a cool geometric profile that adds an extra dimension of visual interest. The table features a strong, deep flat frieze, adding a layer of depth and refinement to its overall design. Elevate your interior with the Drift Console Table, a masterpiece of subtle sophistication and a testament to the collaboration between Kelly Hoppen and DAVIDSON. This exceptional piece transcends functionality, transforming into a statement of style, sophistication, and luxury that will be cherished for years to come.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2023/10/Drift_ConsoleTable_KellyHoppenxDavidsonLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 3}, {"style_name": ".MINIMALISM", "weight": 37}, {"style_name": ".MID_CENTURY_MODERN", "weight": 5}, {"style_name": ".COUNTRY", "weight": 1}, {"style_name": ".COSTAL", "weight": 5}, {"style_name": ".RUSTIC", "weight": 2}, {"style_name": ".ART_DECO", "weight": 1}, {"style_name": ".INDUSTRIAL", "weight": 5}, {"style_name": ".SHABBY_CHIC", "weight": 1}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 5}, {"style_name": ".BOHEMIAN", "weight": 0}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 1}, {"style_name": ".TRANSITIONAL", "weight": 2}, {"style_name": ".CHALET", "weight": 3}, {"style_name": ".FRENCH_CLASSICAL", "weight": 6}, {"style_name": ".SCANDINAVIAN", "weight": 14}]}