{"name": "The ZigZag Occasional Table by Kelly Hoppen - Davidson", "price": "None", "currency": "None", "width": "60", "height": "60", "depth": "30", "dimension_unit": "cm", "description": "Discover the ZigZag Occasional Table, a testament to the collaborative brilliance of Kelly Hoppen for DAVIDSON. This luxury occasional table transcends conventional design, standing as a unique blend of elegance and glamour.\nThe pièce de résistance of the ZigZag table lies in its striking single red lacquered leg, a bold and striking accent that sets it apart. This singular pop of colour amidst the sleek black lacquer tabletop adds a touch of drama and sophistication.\nCrafted with precision, the table features three geometric zigzag-shaped legs, offering a distinctive visual appeal. The tabletop, finished in a sophisticated high gloss lacquer, exudes a smooth radiance, complemented by soft angles that lend an air of refinement.\nThe ZigZag Occasional Table is not just a piece of furniture; it's a statement of style and versatility. Whether styled as a bedside table, showcased in a drawing room, or positioned as an entryway statement, it effortlessly complements contemporary spaces with its unique design.\nElevate your interior with the ZigZag Occasional Table, a fusion of Kelly Hoppen's renowned design sensibilities and DAVIDSON's commitment to luxury craftsmanship. This exceptional piece transcends the ordinary, becoming a centrepiece of sophistication and artistry that will be cherished for years to come.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2023/10/ZigZag_OccasionalTable_KellyHoppenxDavidsonLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 1}, {"style_name": ".MINIMALISM", "weight": 61}, {"style_name": ".MID_CENTURY_MODERN", "weight": 1}, {"style_name": ".COUNTRY", "weight": 2}, {"style_name": ".COSTAL", "weight": 3}, {"style_name": ".RUSTIC", "weight": 1}, {"style_name": ".ART_DECO", "weight": 3}, {"style_name": ".INDUSTRIAL", "weight": 3}, {"style_name": ".SHABBY_CHIC", "weight": 0}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 3}, {"style_name": ".BOHEMIAN", "weight": 0}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 3}, {"style_name": ".TRANSITIONAL", "weight": 3}, {"style_name": ".CHALET", "weight": 1}, {"style_name": ".FRENCH_CLASSICAL", "weight": 4}, {"style_name": ".SCANDINAVIAN", "weight": 4}]}