{"name": "The Babington Games Table", "price": "None", "currency": "None", "width": "125", "height": "79", "depth": "None", "dimension_unit": "cm", "description": "Enjoy your favourite game in impeccable style with the Babington, an exclusive games table that brings a newfound glamour to centuries-old pastimes. Finished in any of DAVIDSON's exquisite finishes and luxury detailing, the Babington exudes a smart sleekness designed with sleek curves and sweeping lines. Add a unique element to your entertaining by treating guests to a game of cards, chess, or backgammon at a table that has been designed with ease, comfort and elegance in mind. The table is composed of a round top with a central inset square, featuring an inlaid grey baize card-playing surface to one side and an inlaid chess board to the other. The top can be flipped over or removed by pressing down on one of the edges to reveal a finger groove that allows a smooth transition between games. It has one drawer, which is flock lined and compartmentalised to home playing pieces and two packs of playing cards. Representing the best in refined design, the Babington Games Table brings together leisure, style and function. As a unique gift or a new addition to a luxury living space, the Babington creates an air of fun and exuberance to an interior.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2022/05/Babington_GamesTable_SycamoreBlack_DAVIDSONLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 10}, {"style_name": ".MINIMALISM", "weight": 2}, {"style_name": ".MID_CENTURY_MODERN", "weight": 29}, {"style_name": ".COUNTRY", "weight": 1}, {"style_name": ".COSTAL", "weight": 4}, {"style_name": ".RUSTIC", "weight": 1}, {"style_name": ".ART_DECO", "weight": 4}, {"style_name": ".INDUSTRIAL", "weight": 9}, {"style_name": ".SHABBY_CHIC", "weight": 1}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 2}, {"style_name": ".BOHEMIAN", "weight": 3}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 1}, {"style_name": ".TRANSITIONAL", "weight": 3}, {"style_name": ".CHALET", "weight": 2}, {"style_name": ".FRENCH_CLASSICAL", "weight": 3}, {"style_name": ".SCANDINAVIAN", "weight": 18}]}