{"name": "The Beam Centre Table by Kelly Hoppen - Davidson", "price": "None", "currency": "None", "width": "90", "height": "None", "depth": "90", "dimension_unit": "cm", "description": "Discover the Beam Centre Table, a creation born from the collaborative genius of Kelly Hoppen for DAVIDSON. This luxury console table stands as a striking testament to modern sophistication, where taupe ash legs provide a graceful foundation for a sleek black lacquered top. The legs, inspired by Kelly Hoppen's signature taupe, add a touch of warmth and elegance to the design. The high gloss lacquered tabletop, measuring 900mm in diameter, exudes a refined polish, creating a focal point that captures the eye. Designed to be a versatile centrepiece, the Beam Centre Table is equally at home in a grand entrance hall or as a small dining table. Its contrasting lacquer top and veneer legs add a layer of visual interest and sophistication to the design. Supported by four tapered legs, the table stands as a testament to meticulous craftsmanship and thoughtful design. Elevate your interior with this exceptional piece, a result of the collaboration between Kelly Hoppen and DAVIDSON. This console table transcends the ordinary, becoming a statement of style, sophistication, and luxury. It not only reflects Kelly Hoppen's renowned design sensibilities but also showcases DAVIDSON's commitment to crafting exquisite pieces that stand the test of time.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2023/10/Beam_CentreTable_KellyHoppenxDavidsonLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 6}, {"style_name": ".MINIMALISM", "weight": 23}, {"style_name": ".MID_CENTURY_MODERN", "weight": 5}, {"style_name": ".COUNTRY", "weight": 1}, {"style_name": ".COSTAL", "weight": 4}, {"style_name": ".RUSTIC", "weight": 4}, {"style_name": ".ART_DECO", "weight": 1}, {"style_name": ".INDUSTRIAL", "weight": 3}, {"style_name": ".SHABBY_CHIC", "weight": 0}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 5}, {"style_name": ".BOHEMIAN", "weight": 1}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 1}, {"style_name": ".TRANSITIONAL", "weight": 3}, {"style_name": ".CHALET", "weight": 6}, {"style_name": ".FRENCH_CLASSICAL", "weight": 5}, {"style_name": ".SCANDINAVIAN", "weight": 23}]}