{"name": "The Vesper Home Bar", "price": "None", "currency": "None", "width": "291", "height": "260.5", "depth": "58.1", "dimension_unit": "cm", "description": "Designed with entertainment in mind, the Vesper is the ultimate high-end home bar for those who revel gathering in their abode. Finished in our classic Sycamore Black or modern Shadow Grey Anegre with elegant brushed brass trimming and ironmongery details, the Vesper is sure to compliment any stylish drawing room.\nA luxurious Nero Assoluto black granite work top is complimented by adjustable glass shelves while the antiqued mirror backbar provides a rustic touch to an otherwise exceptionally polished piece of furniture.\nThree central drawers provide well thought out storage to your most cherished glassware, with individual flock-lined compartments for tumblers, high ball, brandy and wine and coupe glasses. Centrally wine can be stored horizontally at room temperature. Wine coolers could be installed within the wings of the cabinet for temperature-controlled beverages.\nThe open shelves to either side of the backbar are backlit with LED uplighters, creating the perfect place for art to perch, further integrating the bar into one's drawing room and overall interior design of the home.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2022/08/Vesper_HomeBarUnit_SycamoreBlack_DAVIDSONLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 8}, {"style_name": ".MINIMALISM", "weight": 1}, {"style_name": ".MID_CENTURY_MODERN", "weight": 1}, {"style_name": ".COUNTRY", "weight": 1}, {"style_name": ".COSTAL", "weight": 1}, {"style_name": ".RUSTIC", "weight": 29}, {"style_name": ".ART_DECO", "weight": 2}, {"style_name": ".INDUSTRIAL", "weight": 4}, {"style_name": ".SHABBY_CHIC", "weight": 8}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 4}, {"style_name": ".BOHEMIAN", "weight": 2}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 0}, {"style_name": ".TRANSITIONAL", "weight": 8}, {"style_name": ".CHALET", "weight": 16}, {"style_name": ".FRENCH_CLASSICAL", "weight": 4}, {"style_name": ".SCANDINAVIAN", "weight": 3}]}