{"name": "The Wellington Desk", "price": "None", "currency": "None", "width": "160", "height": "75", "depth": "90", "dimension_unit": "cm", "description": "The Wellington represents an incredibly smart and sleek office solution, with ample storage for all your study needs. Be bold with this writing table that exudes confidence and charisma. The desk can be finished in any of DAVIDSON's exquisite finishes, with rectilinear handles in your chosen metal that best flatters your interior. This sturdy design has a frieze measuring 100mm, with four shallow drawers constructed in the traditional way and two pedestals beneath. The left pedestal consists of four drawers on soft-close runners and the right pedestal consists of a single drawer. The lower three drawer fronts form a large, optional filing drawer. The Wellington desk features a stylish chamfered edge below the table frieze and at the base of each pedestal. This subtle but intriguing feature breaks up the design, bringing a casual elegance to the overall look, while also being a testament to the enduring quality of DAVIDSON craftsmanship. The desk is completed with a leather writing surface available in your choice of colour. There are two cable access points in the left and right corners for a neat and tidy working space, finished in satin, timber to match the body of the desk.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2022/05/Wellington_Desk_DarkTintedOak_PolishedBrass_Accessories_DAVIDSONLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 15}, {"style_name": ".MINIMALISM", "weight": 2}, {"style_name": ".MID_CENTURY_MODERN", "weight": 23}, {"style_name": ".COUNTRY", "weight": 1}, {"style_name": ".COSTAL", "weight": 5}, {"style_name": ".RUSTIC", "weight": 3}, {"style_name": ".ART_DECO", "weight": 4}, {"style_name": ".INDUSTRIAL", "weight": 2}, {"style_name": ".SHABBY_CHIC", "weight": 1}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 4}, {"style_name": ".BOHEMIAN", "weight": 2}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 0}, {"style_name": ".TRANSITIONAL", "weight": 16}, {"style_name": ".CHALET", "weight": 2}, {"style_name": ".FRENCH_CLASSICAL", "weight": 5}, {"style_name": ".SCANDINAVIAN", "weight": 9}]}