{"name": "The Drift Side Table by Kelly Hoppen", "price": "None", "currency": "None", "width": "40", "height": "45", "depth": "None", "dimension_unit": "cm", "description": "Discover the Drift Side Table, a testament to the collaboration between Kelly Hoppen and DAVIDSON, this luxury side table effortlessly combines form and function. Crafted with meticulous detail, it stands as a distinguished piece in contemporary interior design. The grey ash legs provide a cool, sophisticated base for this exquisite table. Its bright white lacquer top offers a pristine canvas, radiating a clean and minimalist charm that harmonises seamlessly with any decor. The Drift Side Table boasts a bold, artisanal shape that commands attention and adds a distinctive touch to your space. The chunky, deep top finished in a bright white lacquer is not only visually striking but also provides a functional surface for your cherished items. The legs are expertly crafted in a geometric form, offering a modern aesthetic that complements the clean lines of the top. The high gloss lacquer top contrasts elegantly with the matte finish of the ash veneer legs, creating a visually captivating piece. The cool, smoked-grey ash legs add a touch of sophistication and provide a sturdy foundation for this exceptional side table. This table is the perfect drawing room accessory, serving as an ideal complement to any luxurious sofa, creating a cohesive and inviting space. Its clean lines and distinctive shape make it perfectly suited for contemporary spaces with a penchant for unique, standout pieces. The round top gracefully sits upon three shaped legs, creating a cool geometric profile that adds an extra dimension of visual interest. The table features a strong, deep flat frieze, adding a layer of depth and refinement to its overall design. Elevate your interior with the Drift Side Table, a fusion of Kelly Hoppen's renowned design sensibilities and DAVIDSON's commitment to luxury craftsmanship. This exceptional piece is more than just a table; it's a statement of style, sophistication, and functionality that will be cherished for years to come.", "image_url": "https://davidsonlondon.com/wp-content/uploads/2023/10/Drift_SideTable_KellyHoppenxDavidsonLondon.jpg", "product_code": "None", "extension": "jpeg", "styles": [{"style_name": ".CONTEMPORARY", "weight": 3}, {"style_name": ".MINIMALISM", "weight": 24}, {"style_name": ".MID_CENTURY_MODERN", "weight": 4}, {"style_name": ".COUNTRY", "weight": 2}, {"style_name": ".COSTAL", "weight": 7}, {"style_name": ".RUSTIC", "weight": 9}, {"style_name": ".ART_DECO", "weight": 6}, {"style_name": ".INDUSTRIAL", "weight": 5}, {"style_name": ".SHABBY_CHIC", "weight": 1}, {"style_name": ".CLASSICAL_SLASH_TRADITIONAL", "weight": 8}, {"style_name": ".BOHEMIAN", "weight": 1}, {"style_name": ".ELECTRIC_SLASH_RETRO", "weight": 1}, {"style_name": ".TRANSITIONAL", "weight": 4}, {"style_name": ".CHALET", "weight": 5}, {"style_name": ".FRENCH_CLASSICAL", "weight": 4}, {"style_name": ".SCANDINAVIAN", "weight": 7}]}