{"name": "Kiss Console", "price": "8875", "currency": "€", "width": "150", "height": "90", "depth": "35", "dimension_unit": "cm", "description": "The Kiss Console by Kifu Paris is an elegant and organic piece in it's unique design. The cream shagreen inlaid piece curves inwards to create the \"kiss\" effect. The borders are accentuated by bronze-patina brass. This piece is designed by Kifu Augousti the daughter of Ria and Yiouri Augousti. Available in other finishes. Part of the Kiss Capsule. The finish of the shagreen is authentic as it is hand-dyed and the designer calls the finish look: \"antique natural shagreen.\" Currently made to order 8-10 weeks. Design SKU reference KCON11. All Kifu Paris pieces are handmade by artisans, ultimately making each piece unique. Custom color/sizing available on request. Wipe clean with soft dry cloth. Made in Philippines. Although inspired by her parents, her collection of Home Accessories and Furniture is a distinct identity of its own. Kifu uses handmade techniques of elaborate inlay patterns of shagreen, shells, semi-precious stones, materials she experienced as a child growing up in her parent's studio, but interpreted in a younger quirkier way reflecting her youth. From her \"jewelry inspired knobs\" on decorative boxes, gold bar boxes and an extravagant inlay pattern mix of shagreen and shell inspired by galactic constellations, as seen on her enormous round mirror, is refreshing to see. Kifu embodies whimsical elements throughout her collection and is not afraid to be daring and unexpected in her approach to design. All shagreen-covered items should be kept out of direct sunlight, color variants may occur on the stingray and other exotic finishes, but this showcases the Parisian label's commitment to creating authentic luxurious products using natural components.", "image_url": "https://images.squarespace-cdn.com/content/v1/5a010700d0e6287d9d4fca2f/1647698031844-B0HVCDKSPYBZSQKTZQL6/KCON11-D1-V1.jpg?format=500w", "product_code": "KCON11", "extension": "jpeg"}