{"name": "Dandy II Tabletop Bench", "price": "8465", "currency": "\n€", "width": "165", "height": "53", "depth": "42", "dimension_unit": "cm", "description": "Inspired by the original Dandy bench by KIFU PARIS, the Dandy II Tabletop Bench is the ultimate luxury seating. The seating area is inlaid in cream shagreen and the frame, legs and sides of the bench are completely inlaid in bronze-patina brass. On the left and right side of the bench are flat armrests inlaid in shagreen that act as tabletop parts to rest a drink or small item.Currently made to order 8-10 weeksDesign SKU reference KLOV03·     Handmade·     Cream shagreen, and bronze-patina brass legs ·     Wipe clean with soft dry cloth·     Made in PhilippinesAlthough inspired by her parents, her collection of Home Accessories and Furniture is a distinct identity of its own. Kifu uses handmade techniques of elaborate inlay patterns of shagreen, shells, semi-precious stones, materials she experienced as a child growing up in her parent's studio, but interpreted in a younger quirkier way reflecting her youth. From her \"jewelry inspired knobs\" on decorative boxes, gold bar boxes and an extravagant inlay pattern mix of shagreen and shell inspired by galactic constellations, as seen on her enormous round mirror, is refreshing to see. Kifu embodies whimsical elements throughout her collection and is not afraid to be daring and unexpected in her approach to design. All shagreen-covered items should be kept out of direct sunlight, color variants may occur on the stingray and other exotic finishes, but this showcases the Parisian label's commitment to creating authentic luxurious products using natural components. Please Note KIFU PARIS's Terms & Conditions. A notification for shipment charges will follow after the order, items that are not currently in stock will result in a 8-10 week lead time for furniture, and 5-6 weeks for accessories.", "image_url": "https://images.squarespace-cdn.com/content/v1/5a010700d0e6287d9d4fca2f/1623156081385-E908TV0BIRB8UJVZ8QQU/BENCH_02_Vue020000.jpg?format=500w", "product_code": "KLOV03", "extension": "jpeg"}