{"name": "Rhapsody Console with Polished Steel Legs", "price": "9805.00", "currency": "€", "width": "150", "height": "95", "depth": "34", "dimension_unit": "cm", "description": "Inspired by the original Rhapsody lamp, by her fiancée Patrick Coard Paris, Kifu Paris designs a sculptural console as an ode to his iconic lighting collection. The console tabletop is inlaid in cream shagreen and sits on 5 polished steel \"rhapsody\" legs that are a mixture of solid and cut-out shapes. The legs clasp the side of the top creating another elegant detail. Available in other finishes.Currently made to order 8-10 weeksDesign SKU reference KCON09The dimensions of this piece are 150 x 34 x 95 cmAll Kifu Paris pieces are handmade by artisans, ultimately making each piece unique.Custom color/sizing available on requestWipe clean with soft dry clothMade in PhilippinesAlthough inspired by her parents, her collection of Home Accessories and Furniture is a distinct identity of its own. Kifu uses handmade techniques of elaborate inlay patterns of shagreen, shells, semi-precious stones, materials she experienced as a child growing up in her parent's studio, but interpreted in a younger quirkier way reflecting her youth. From her \"jewelry inspired knobs\" on decorative boxes, gold bar boxes and an extravagant inlay pattern mix of shagreen and shell inspired by galactic constellations, as seen on her enormous round mirror, is refreshing to see. Kifu embodies whimsical elements throughout her collection and is not afraid to be daring and unexpected in her approach to design. All shagreen-covered items should be kept out of direct sunlight, color variants may occur on the stingray and other exotic finishes, but this showcases the Parisian label's commitment to creating authentic luxurious products using natural components.", "image_url": "https://images.squarespace-cdn.com/content/v1/5a010700d0e6287d9d4fca2f/1630506436186-CH215L8AFC7KTISPZSSD/210830+Console10001.jpg?format=500w", "product_code": "KCON09", "extension": "jpeg"}