{"name": "Odette - Ceccotti Collezioni", "price": "None", "currency": "None", "width": "None", "height": "None", "depth": "None", "dimension_unit": "None", "description": "Designed by DRAW Studio, the Odette side table can be mounted on the wall and is fully made from North American walnut solid wood. It features a lightweight and delicate design and can be paired with the Odile table from the same collection, sharing smooth designs and meticulous structures that complement each other. The beauty of elegant rhythms is embedded throughout: reminiscent of a classical ballerina tiptoeing and floating in the air, displaying a light and harmonic posture. Every component of Odette aims to reflect this visual lightness, achieved through exquisite craftsmanship, including as minimal as possible use of solid walnut wood for elliptical components, smooth transitions in conical table legs, and delicate conical crossbars. The tabletop options include transparent, smoked, or bronze glass or marble, level with the wooden frame. Additionally, Ceccotti Collezioni has developed a special craftsmanship system for the marble version, creating plates only 8mm thick—significantly thinner than the usual 20mm plates found in other designs. This reduction in weight allows the tabletop to perfectly integrate into the wooden frame. The key in design and production is to create a visually light effect while ensuring the structure is robust, stable, and durable. The designers at DRAW Studio state that the Odette side table 'blends simple modern lines with the long tradition of Italian woodcraft, integrating these distinct elements with elegantly curved and smooth transitions, paying homage to past master designs. We are eager to create works containing these kinds of relationships: lingering over time yet hoping to pause time with a gesture, form, or object. Like a grand opera or choreography, revealing enduring charm in perpetual performance.'", "image_url": "https://www.ceccotticollezioni.it/wp-content/uploads/2020/11/Odette_01-4-600x450.jpg", "product_code": "None", "extension": "jpeg"}